brew "node"
brew "gemini-cli"
brew "mactop"
brew "neovim"
brew "pyenv"
brew "stow"
brew "uv"
cask "aldente"
cask "brave-browser"
cask "claude-code"
cask "docker-desktop"
cask "font-jetbrains-mono"
cask "karabiner-elements"
cask "mamp"
cask "mos"
cask "obsidian"
cask "osaurus"
cask "protonvpn"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"
vscode "bmewburn.vscode-intelephense-client"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "vscodevim.vim"
