# Manages symlinks for dotfiles
brew "stow"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Rust-based terminal
cask "warp"

# Window manager — snap windows with keyboard shortcuts
cask "rectangle"
cask "google-chrome"
cask "visual-studio-code"
# Docker Desktop (engine + CLI + Compose); `brew "docker"` would be CLI-only
cask "docker"
cask "logi-options+"
cask "mamp"
cask "obsidian"
cask "spotify"
cask "vlc"
cask "zoom"
